Tekla Open API Reference for Tekla Structures 2025
AnalysisArea.Area Property
 Gets or sets the area polygon of the analysis area.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisAreaPolygon Area { get; set; }
Public Property Area As AnalysisAreaPolygon
	Get
	Set
Property Value
Type: AnalysisAreaPolygon
See Also
Reference
AnalysisArea Class
Tekla.Structures.Analysis Namespace